app/components/Seo.php

    public static function init()
    {
        if (self::$meta === FALSE)
        {
            //	Массив мета-тегов для страницы
            self::$meta = [
                    'title' => '',
                    'description' => '',
                    'h1' => '',
//                    'h2' => '',
                    'text' => '',
//                    'robots' => ''
            ];

            //	Ручные значения тегов из админки
            $url = $_SERVER['REQUEST_URI'];
            $url = preg_replace('#^'.preg_quote(Lang::getCurrentUrl(), '#').'#', '/', $url);
            $static = \app\models\Seo::find()->joinWith('info', true)
                    ->andWhere(['url' => $url, 'type' => 'static'])
                    ->asArray()
                    ->limit(1)
                    ->one();
---
SELECT `seo`.* FROM `seo` LEFT JOIN `seo_info` ON (`seo`.`id` = `seo_info`.`record_id`) AND (`seo_info`.`lang`=1) WHERE (`url`='/news/page/2') AND (`type`='static') LIMIT 1

    public static function setByTemplate($template, $data)
    {
        self::init();
        $template = \app\models\Seo::find()->innerJoinWith(['info'], true)
                ->andWhere(['url' => $template, 'type' => 'template'])->asArray()->one();
---
SELECT `seo`.* FROM `seo` INNER JOIN `seo_info` ON (`seo`.`id` = `seo_info`.`record_id`) AND (`seo_info`.`lang`=2) WHERE (`url`='default') AND (`type`='template')